<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="utf-8">
    <title>Hojas de Personaje | Inicio</title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="">
    <meta name="author" content="">

    <!-- Le styles -->
    <link href="css/bootstrap.css" rel="stylesheet">
    <style>
      body {
        padding-top: 60px; /* 60px to make the container go all the way to the bottom of the topbar */
      }
    </style>
    <link href="css/bootstrap-responsive.css" rel="stylesheet">

    <!-- HTML5 shim, for IE6-8 support of HTML5 elements -->
    <!--[if lt IE 9]>
      <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Fav and touch icons -->
    <link rel="apple-touch-icon-precomposed" sizes="144x144" href="ico/apple-touch-icon-144-precomposed.png">
    <link rel="apple-touch-icon-precomposed" sizes="114x114" href="ico/apple-touch-icon-114-precomposed.png">
    <link rel="apple-touch-icon-precomposed" sizes="72x72" href="ico/apple-touch-icon-72-precomposed.png">
    <link rel="apple-touch-icon-precomposed" href="ico/apple-touch-icon-57-precomposed.png">
    <link rel="shortcut icon" href="ico/favicon.png">
  </head>

  <body>

    <div class="navbar navbar-inverse navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container">
          <a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </a>
          <a class="brand" href="index.html">Hojas de Personaje</a>
          <div class="nav-collapse collapse">
            <ul class="nav">
              <li><a href="index.html">Inicio</a></li>
              <li><a href="biblioteca.html">Biblioteca</a></li>
              <li><a href="crear.html">Nueva Hoja de Personaje</a>
              <li class="active"><a href="acerca.html">Acerca de</a></li>
              <li><a href="#contact">Contacto</a></li>
            </ul>
            <form class="navbar-form pull-right">
              <input class="span2" type="text" placeholder="Nombre de usuario">
              <input class="span2" type="password" placeholder="Contrase&ntilde;a">
              <a href="biblioteca.html" class="btn btn-primary">Entrar</a>
            </form>
          </div><!--/.nav-collapse -->
        </div>
      </div>
    </div>

    <div class="container">
      <h1>Acerca del proyecto</h1>
      <p>Este prototipo ha sido creado como parte de uno mayor que en un futuro permitir&aacute; crear, editar y mantener una biblioteca de hojas de personaje para juegos de rol de sobremesa.</p>
      <p>Es un proyecto encargado a los alumnos del primer curso del ciclo formativo de Desarrollo de Aplicaciones Web del IEFPS Elorrieta - Erreka Mari, para la clase de Entornos de Desarrollo.</p>
      <p>El proyecto no incluye como objetivo la realizaci&oacute;n del c&oacute;digo propiamente dicho, pero en un futuro espero terminarlo como un proyecto personal.</p>
      <h2>Herramientas utilizadas para el prototipo de interface</h2>
      <h3>Bootstrap</h3>
      <p>La base del prototipo es el famoso framework <a href="http://twitter.github.com/bootstrap/">Bootstrap</a> de twitter, que me permite utilizar sus elementos para crear el interfaz r&aacute;pidamente y sin preocuparme demasiado del c&oacute;digo, especialmente del CSS y el javascript.</p>
      <p>Bootstrap hace sencillo crear p&aacute;ginas web y aplicaciones que funcionen en todos los navegadores y dispositivos usando responsive CSS.</p>
      <p>Con Bootstrap vienen incluidos los <a href="http://glyphicons.com/">Glyphicons</a> que tambi&eacute;n he utilizado.</p>
      <h3>Git</h3>
      <p>Se ha sometido a todos los elementos de configuraci&oacute;n de software a un control de cambios, utilizando para ello la herramienta <a href="http://git-scm.com/">git</a>. No era un objetivo de la actividad, pero los CVS s&iacute; son parte de la asignatura y tampoco emprender&iacute;a ning&uacute;n proyecto que me llevara m&aacute;s de diez minutos sin llevar un control.</p>
      <p>La mayor ventaja de git frente a otros CVS es la posibilidad de creaci&oacute;n de ramas, que permiten trabajar con diferentes partes de un proyecto simult&aacute;neamente y experimentar sin miedo a perder el trabajo realizado en las otras ramas, especialmente la principal o master.</p>
      <p>Otra ventaja es que es distribuido, todos los usuarios tienen una copia del repositorio completo en local. A pesar de que el &uacute;nico usuario que trabaja en el proyecto soy yo, esto me ha permitido poder trabajar en el ordenador de casa y en las diferentes particiones del ordenador del centro sin problema y sin miedo a perder los datos en caso de corrupci&oacute;n o borrado accidental.</p>
      <p>Tampoco es necesaria la existencia de un servidor central aunque&hellip;</p>
      <h3>GitHub</h3>
      <p>&hellip; <a href="https://github.com/">GitHub</a> me ha permitido tener uno igualmente. GitHub es una comunidad que permite tener m&uacute;ltiples repositorios gratuitos de c&oacute;digo abierto, accesibles a trav&eacute;s de Internet. Esto facilitar&iacute;a mucho la tarea de trabajar en equipo si el proyecto no fuera individual, pero tambi&eacute;n ofrece herramientas muy interesantes de visualizaci&oacute;n de <a href="https://github.com/jaquanor/hojas-interfaces/commits/master">revisiones</a>, <a href="https://github.com/jaquanor/hojas-interfaces/network">ramas</a>, <a href="https://github.com/jaquanor/hojas-interfaces">ficheros</a>&hellip; incluso tiene su propio <a href="https://github.com/jaquanor/hojas-interfaces/issues">issue tracker</a>, en el que los hipot&eacute;ticos usuarios o contribuyentes al c&oacute;digo podr&iacute;an se&ntilde;alar problemas y contribuir c&oacute;digo.</p>
      <p>Es interesante (aunque algo avergonzante para un novato como yo) poder ver toda la evoluci&oacute;n que ha ido teniendo el proyecto en todas sus fases.</p>
      <p>Las comunidades de colaboraci&oacute;n en c&oacute;digo abierto son tambi&eacute;n objetivo de estudio en la asignatura y por eso he publicado este proyecto como tal.</p>

    </div> <!-- /container -->

    <!-- Le javascript
    ================================================== -->
    <!-- Placed at the end of the document so the pages load faster -->
    <script src="js/jquery.js"></script>
    <script src="js/bootstrap.min.js"></script>

  </body>
</html>
